
# coding: utf-8

# In[1]:

import os
import re
import sys


# In[2]:

tlg_path_rel = '~/cltk_data/compiled/tlg/'
tlg_path_abs = os.path.expanduser(tlg_path_rel)
tlg_files = os.listdir(tlg_path_abs)


# In[3]:

#d = re.compile(r'([a-z]\s)([A-Z][a-zA-Z]+)')
#uppers = 'Ά|Έ|Ή|Ί|Ό|Ύ|Ώ|ΐ|Α|Β|Γ|Δ|Ε|Ζ|Η|Θ|Ι|Κ|Λ|Μ|Ν|Ξ|Ο|Π|Ρ|Σ|Τ|Υ|Φ|Χ|Ψ|Ω|Ϊ|Ϋ|Ά|Έ|Ή|Ί|Ό|Ύ|Ώ|ΐ|Α|Ε|Η|Ι|Ο|Ρ|Υ|Ω|Ϊ|Ϋ|Ἀ|Ἁ|Ἂ|Ἃ|Ἄ|Ἅ|Ἆ|Ἇ|Ἐ|Ἑ|Ἒ|Ἓ|Ἔ|Ἕ|Ἰ|Ἱ|Ἲ|Ἳ|Ἴ|Ἵ|Ἶ|Ἷ|Ὀ|Ὁ|Ὂ|Ὃ|Ὄ|Ὅ|Ὑ|Ὓ|Ὕ|Ὗ|Ὠ|Ὡ|Ὢ|Ὣ|Ὤ|Ὥ|Ὦ|Ὧ|ᾈ|ᾉ|ᾊ|ᾋ|ᾌ|ᾍ|ᾎ|ᾏ|ᾘ|ᾙ|ᾚ|ᾛ|ᾜ|ᾝ|ᾞ|ᾟ|ᾨ|ᾩ|ᾪ|ᾫ|ᾬ|ᾭ|ᾮ|ᾯ|Ᾰ|Ᾱ|Ὰ|ᾼ|Ὲ|Ὴ|ῌ|Ῐ|Ῑ|Ὶ|Ὸ|Ὼ|ῼ|Ῠ|Ῡ|Ὺ|Ῥ'
#lowers = 'ά|έ|ή|ί|ΰ|α|ε|η|ι|ο|ρ|υ|ω|ϊ|ϋ|ό|ύ|ώ|ἀ|ἁ|ἂ|ἃ|ἄ|ἅ|ἆ|ἇ|ἠ|ἡ|ἢ|ἣ|ἤ|ἥ|ἦ|ἧ|ἰ|ἱ|ἲ|ἳ|ἴ|ἵ|ἶ|ἷ|ὀ|ὁ|ὂ|ὃ|ὄ|ὅ|ὐ|ὑ|ὒ|ὓ|ὔ|ὕ|ὖ|ὗ|ὠ|ὡ|ὢ|ὣ|ὤ|ὥ|ὦ|ὧ|ὰ|ὲ|ὴ|ὶ|ὸ|ὺ|ὼ|ᾀ|ᾁ|ᾂ|ᾃ|ᾄ|ᾅ|ᾆ|ᾇ|ᾐ|ᾑ|ᾒ|ᾓ|ᾔ|ᾕ|ᾖ|ᾗ|ᾠ|ᾡ|ᾢ|ᾣ|ᾤ|ᾥ|ᾦ|ᾧ|ᾰ|ᾱ|ᾲ|ᾳ|ᾴ|ᾶ|ᾷ|ῂ|ῃ|ῄ|ῆ|ῇ|ῐ|ῑ|ῒ|ῖ|ῗ|ῠ|ῡ|ῢ|ῤ|ῥ|ῦ|ῧ|ῲ|ῳ|ῴ|ῶ|ῷ|ἐ|ἑ|ἒ|ἓ|ἔ|ἕ|ά|έ|ή|ί|ΰ|α|β|γ|δ|ε|ζ|η|θ|ι|κ|λ|μ|ν|ξ|ο|π|ρ|ς|σ|τ|υ|φ|χ|ψ|ω|ϊ|ϋ|ό|ύ|ώ'


# In[4]:

d = re.compile(r'([ά|έ|ή|ί|ΰ|α|ε|η|ι|ο|ρ|υ|ω|ϊ|ϋ|ό|ύ|ώ|ἀ|ἁ|ἂ|ἃ|ἄ|ἅ|ἆ|ἇ|ἠ|ἡ|ἢ|ἣ|ἤ|ἥ|ἦ|ἧ|ἰ|ἱ|ἲ|ἳ|ἴ|ἵ|ἶ|ἷ|ὀ|ὁ|ὂ|ὃ|ὄ|ὅ|ὐ|ὑ|ὒ|ὓ|ὔ|ὕ|ὖ|ὗ|ὠ|ὡ|ὢ|ὣ|ὤ|ὥ|ὦ|ὧ|ὰ|ὲ|ὴ|ὶ|ὸ|ὺ|ὼ|ᾀ|ᾁ|ᾂ|ᾃ|ᾄ|ᾅ|ᾆ|ᾇ|ᾐ|ᾑ|ᾒ|ᾓ|ᾔ|ᾕ|ᾖ|ᾗ|ᾠ|ᾡ|ᾢ|ᾣ|ᾤ|ᾥ|ᾦ|ᾧ|ᾰ|ᾱ|ᾲ|ᾳ|ᾴ|ᾶ|ᾷ|ῂ|ῃ|ῄ|ῆ|ῇ|ῐ|ῑ|ῒ|ῖ|ῗ|ῠ|ῡ|ῢ|ῤ|ῥ|ῦ|ῧ|ῲ|ῳ|ῴ|ῶ|ῷ|ἐ|ἑ|ἒ|ἓ|ἔ|ἕ|ά|έ|ή|ί|ΰ|α|β|γ|δ|ε|ζ|η|θ|ι|κ|λ|μ|ν|ξ|ο|π|ρ|ς|σ|τ|υ|φ|χ|ψ|ω|ϊ|ϋ|ό|ύ|ώ]\s)([Ά|Έ|Ή|Ί|Ό|Ύ|Ώ|ΐ|Α|Β|Γ|Δ|Ε|Ζ|Η|Θ|Ι|Κ|Λ|Μ|Ν|Ξ|Ο|Π|Ρ|Σ|Τ|Υ|Φ|Χ|Ψ|Ω|Ϊ|Ϋ|Ά|Έ|Ή|Ί|Ό|Ύ|Ώ|ΐ|Α|Ε|Η|Ι|Ο|Ρ|Υ|Ω|Ϊ|Ϋ|Ἀ|Ἁ|Ἂ|Ἃ|Ἄ|Ἅ|Ἆ|Ἇ|Ἐ|Ἑ|Ἒ|Ἓ|Ἔ|Ἕ|Ἰ|Ἱ|Ἲ|Ἳ|Ἴ|Ἵ|Ἶ|Ἷ|Ὀ|Ὁ|Ὂ|Ὃ|Ὄ|Ὅ|Ὑ|Ὓ|Ὕ|Ὗ|Ὠ|Ὡ|Ὢ|Ὣ|Ὤ|Ὥ|Ὦ|Ὧ|ᾈ|ᾉ|ᾊ|ᾋ|ᾌ|ᾍ|ᾎ|ᾏ|ᾘ|ᾙ|ᾚ|ᾛ|ᾜ|ᾝ|ᾞ|ᾟ|ᾨ|ᾩ|ᾪ|ᾫ|ᾬ|ᾭ|ᾮ|ᾯ|Ᾰ|Ᾱ|Ὰ|ᾼ|Ὲ|Ὴ|ῌ|Ῐ|Ῑ|Ὶ|Ὸ|Ὼ|ῼ|Ῠ|Ῡ|Ὺ|Ῥ][ά|έ|ή|ί|ΰ|α|ε|η|ι|ο|ρ|υ|ω|ϊ|ϋ|ό|ύ|ώ|ἀ|ἁ|ἂ|ἃ|ἄ|ἅ|ἆ|ἇ|ἠ|ἡ|ἢ|ἣ|ἤ|ἥ|ἦ|ἧ|ἰ|ἱ|ἲ|ἳ|ἴ|ἵ|ἶ|ἷ|ὀ|ὁ|ὂ|ὃ|ὄ|ὅ|ὐ|ὑ|ὒ|ὓ|ὔ|ὕ|ὖ|ὗ|ὠ|ὡ|ὢ|ὣ|ὤ|ὥ|ὦ|ὧ|ὰ|ὲ|ὴ|ὶ|ὸ|ὺ|ὼ|ᾀ|ᾁ|ᾂ|ᾃ|ᾄ|ᾅ|ᾆ|ᾇ|ᾐ|ᾑ|ᾒ|ᾓ|ᾔ|ᾕ|ᾖ|ᾗ|ᾠ|ᾡ|ᾢ|ᾣ|ᾤ|ᾥ|ᾦ|ᾧ|ᾰ|ᾱ|ᾲ|ᾳ|ᾴ|ᾶ|ᾷ|ῂ|ῃ|ῄ|ῆ|ῇ|ῐ|ῑ|ῒ|ῖ|ῗ|ῠ|ῡ|ῢ|ῤ|ῥ|ῦ|ῧ|ῲ|ῳ|ῴ|ῶ|ῷ|ἐ|ἑ|ἒ|ἓ|ἔ|ἕ|ά|έ|ή|ί|ΰ|α|β|γ|δ|ε|ζ|η|θ|ι|κ|λ|μ|ν|ξ|ο|π|ρ|ς|σ|τ|υ|φ|χ|ψ|ω|ϊ|ϋ|ό|ύ|ώ]+)')


# In[5]:

names_list = []
for tlg_file in tlg_files:
    if tlg_file.startswith('TLG') and tlg_file.endswith('.txt'):
        file_path = tlg_path_abs + tlg_file
        with open(file_path) as f:
            opened_txt = f.read()
            propers = d.findall(opened_txt)
            for name in propers:
                names_list.append(name[1])


# In[6]:

names_set = set(names_list)


# In[7]:

newlines_str = '\n'.join(names_set)


# In[8]:

with open('proper_names.txt', 'w') as f:
    f.write(newlines_str)

